In [3]:
import pandas as pd

In [6]:
df = pd.read_csv("exemple.csv", index_col = 0) #define index, automatic index exist
df.head() # define how many lines I would see, default parameter is 5

    country        team  trophies
id
0   England   Liverpool         6
1     Spain   Barcelona         5
2   England  Man United         3
3     Italy       Inter         3
4   England     Chelsea         2

In [7]:
df = pd.read_csv("exemple.csv", index_col = 0) #define index
df.head(2) # define how many lines I would see

    country       team  trophies
id
0   England  Liverpool         6
1     Spain  Barcelona         5

In [8]:
df = pd.read_csv("exemple.csv")
df.head(n=2)
len(df["country"])

20

In [10]:
df = pd.read_csv("exemple.csv", index_col = 'id') #define index
df.head(2) # define how many lines I would see

    country       team  trophies
id
0   England  Liverpool         6
1     Spain  Barcelona         5

In [11]:
df.dtypes

country     object
team        object
trophies     int64
dtype: object

In [12]:
df.index

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19], dtype='int64', name='id')

In [13]:
df.index.dtype

dtype('int64')

In [25]:
df[['team','country']].head(2)

         team  country
id
0   Liverpool  England
1   Barcelona    Spain

In [41]:
new_df =df[['team','trophies']].head(2)
new_df

         team  trophies
id
0   Liverpool         6
1   Barcelona         5

Filter fast: df like a list, dictionary with filtering

In [42]:
df[df['trophies'] ==2]

     country          team  trophies
id
4    England       Chelsea         2
5    England       Chelsea         2
6    England  Nottm Forest         2
7   Portugal       Benfica         2
8      Italy      Juventus         2
9   Portugal      FC Porto         2

In [44]:
df[df['country'] =='Italy']

   country      team  trophies
id
3    Italy     Inter         3
8    Italy  Juventus         2

In [45]:
condition1 = df['country'] =='Italy'
condition2 = df['trophies'] ==2
df[condition1 & condition2 ]

   country      team  trophies
id
8    Italy  Juventus         2

In [50]:
df_new=[(df['country'] =='Italy')&(df['trophies'] ==2)]
new_df

         team  trophies
id
0   Liverpool         6
1   Barcelona         5

In [53]:
condition1 = df['country'] =='Italy'
condition2 = df['country'] =='England'
condition3 = df['trophies'] ==2
df[condition1 | condition2 & condition3]#| is or

    country     team  trophies
id
3     Italy    Inter         3
4   England  Chelsea         2

New conditions

In [55]:
condition1 = df['trophies'] ==2
condition1 = df['country'].isin(['Italy','England']) #duble ([]) as we need something iterable
df[condition1 & condition2 ]

    country          team  trophies
id
0   England     Liverpool         6
2   England    Man United         3
4   England       Chelsea         2
5   England       Chelsea         2
6   England  Nottm Forest         2
10  England      Man City         1
14  England   Aston Villa         1

How many team have less than 3 trophies

In [59]:
df[df['trophies']>3].count()

country     2
team        2
trophies    2
dtype: int64

From specific country

In [67]:
england_df = df[df['country'] =='England']
englan_with_2_trophies_df=england_df[england_df['trophies']==2]
englan_with_2_trophies_df

    country          team  trophies
id
4   England       Chelsea         2
5   England       Chelsea         2
6   England  Nottm Forest         2

To show me values

In [68]:
england_df.sort_values('team')

    country          team  trophies
id
14  England   Aston Villa         1
4   England       Chelsea         2
5   England       Chelsea         2
0   England     Liverpool         6
10  England      Man City         1
2   England    Man United         3
6   England  Nottm Forest         2